#!/usr/bin/env python3
"""COMPLETE translation fix for ALL pages - adds every missing element"""
import json
import re
from pathlib import Path

BASE_DIR = Path(__file__).parent

# COMPLETE translations for ALL missing elements
FULL_TRANSLATIONS = {
    # SUBSCRIPTION PAGE - weights, plans
    "subscription_page": {
        "hero_badge": {"uk": "-10% НА КОЖНУ ДОСТАВКУ", "ru": "-10% НА КАЖДУЮ ДОСТАВКУ", "en": "-10% ON EVERY DELIVERY"},
        "plan_starter": {"uk": "Starter", "ru": "Starter", "en": "Starter"},
        "plan_starter_desc": {"uk": "Для знайомства", "ru": "Для знакомства", "en": "For introduction"},
        "plan_coffee_lover": {"uk": "Coffee Lover", "ru": "Coffee Lover", "en": "Coffee Lover"},
        "plan_lover_desc": {"uk": "Ідеальний баланс", "ru": "Идеальный баланс", "en": "Perfect balance"},
        "plan_addict": {"uk": "Coffee Addict", "ru": "Coffee Addict", "en": "Coffee Addict"},
        "plan_addict_desc": {"uk": "Для справжніх цінителів", "ru": "Для настоящих ценителей", "en": "For true connoisseurs"},
        "plan_popular_badge": {"uk": "⭐ НАЙПОПУЛЯРНІШИЙ", "ru": "⭐ САМЫЙ ПОПУЛЯРНЫЙ", "en": "⭐ MOST POPULAR"},
        "plan_per_month": {"uk": "г/місяць", "ru": "г/месяц", "en": "g/month"},
        "plan_pack_1": {"uk": "1 пачка 250г", "ru": "1 пачка 250г", "en": "1 pack 250g"},
        "plan_packs_2": {"uk": "2 пачки по 250г", "ru": "2 пачки по 250г", "en": "2 packs of 250g"},
        "plan_packs_4": {"uk": "4 пачки по 250г", "ru": "4 пачки по 250г", "en": "4 packs of 250g"},
        "plan_monthly": {"uk": "Раз на місяць", "ru": "Раз в месяц", "en": "Once a month"},
        "plan_biweekly": {"uk": "Раз на 2 тижні", "ru": "Раз в 2 недели", "en": "Every 2 weeks"},
        "plan_weekly": {"uk": "Щотижня", "ru": "Еженедельно", "en": "Weekly"},
        "plan_free_shipping": {"uk": "Безкоштовна доставка", "ru": "Бесплатная доставка", "en": "Free shipping"},
        "plan_priority": {"uk": "Пріоритетна підтримка", "ru": "Приоритетная поддержка", "en": "Priority support"},
        "plan_exclusive": {"uk": "Ексклюзивні лоти", "ru": "Эксклюзивные лоты", "en": "Exclusive lots"},
        "choose_plan": {"uk": "Обрати план", "ru": "Выбрать план", "en": "Choose Plan"},
        "how_it_works": {"uk": "Як це працює", "ru": "Как это работает", "en": "How It Works"},
        "step1_title": {"uk": "Оберіть план", "ru": "Выберите план", "en": "Choose Plan"},
        "step1_text": {"uk": "Визначте, скільки кави вам потрібно", "ru": "Определите, сколько кофе вам нужно", "en": "Determine how much coffee you need"},
        "step2_title": {"uk": "Налаштуйте", "ru": "Настройте", "en": "Customize"},
        "step2_text": {"uk": "Обсмажка, помол, частота — все під вас", "ru": "Обжарка, помол, частота — всё под вас", "en": "Roast, grind, frequency — all for you"},
        "step3_title": {"uk": "Отримуйте", "ru": "Получайте", "en": "Receive"},
        "step3_text": {"uk": "Свіжа кава приходить автоматично", "ru": "Свежий кофе приходит автоматически", "en": "Fresh coffee arrives automatically"},
        "step4_title": {"uk": "Насолоджуйтесь!", "ru": "Наслаждайтесь!", "en": "Enjoy!"},
        "step4_text": {"uk": "Ми дбаємо про вашу каву", "ru": "Мы заботимся о вашем кофе", "en": "We take care of your coffee"},
        "faq_title": {"uk": "Часті питання", "ru": "Частые вопросы", "en": "FAQ"},
        "faq_cancel_q": {"uk": "Чи можу я скасувати підписку?", "ru": "Могу ли я отменить подписку?", "en": "Can I cancel my subscription?"},
        "faq_cancel_a": {"uk": "Так, ви можете скасувати або поставити на паузу підписку в будь-який момент.", "ru": "Да, вы можете отменить или поставить на паузу подписку в любой момент.", "en": "Yes, you can cancel or pause your subscription at any time."},
        "faq_change_q": {"uk": "Чи можу я змінити каву?", "ru": "Могу ли я изменить кофе?", "en": "Can I change my coffee?"},
        "faq_change_a": {"uk": "Звичайно! Ви можете змінити сорт кави, обсмажку та помол перед кожною доставкою.", "ru": "Конечно! Вы можете изменить сорт кофе, обжарку и помол перед каждой доставкой.", "en": "Of course! You can change the coffee variety, roast and grind before each delivery."},
        "faq_payment_q": {"uk": "Коли списуються кошти?", "ru": "Когда списываются деньги?", "en": "When am I charged?"},
        "faq_payment_a": {"uk": "Оплата списується автоматично за 2 дні до запланованої доставки.", "ru": "Оплата списывается автоматически за 2 дня до запланированной доставки.", "en": "Payment is charged automatically 2 days before scheduled delivery."}
    },
    
    # GIFT CERTIFICATES PAGE
    "gift_page": {
        "hero_badge": {"uk": "🎁 ІДЕАЛЬНИЙ ПОДАРУНОК", "ru": "🎁 ИДЕАЛЬНЫЙ ПОДАРОК", "en": "🎁 PERFECT GIFT"},
        "hero_title": {"uk": "Подарункові сертифікати", "ru": "Подарочные сертификаты", "en": "Gift Certificates"},
        "hero_text": {"uk": "Подаруйте справжню ефіопську каву", "ru": "Подарите настоящий эфиопский кофе", "en": "Give the gift of authentic Ethiopian coffee"},
        "create_btn": {"uk": "Створити сертифікат", "ru": "Создать сертификат", "en": "Create Certificate"},
        "create_title": {"uk": "Створіть сертифікат", "ru": "Создайте сертификат", "en": "Create Certificate"},
        "amount_label": {"uk": "Оберіть номінал:", "ru": "Выберите номинал:", "en": "Choose amount:"},
        "recipient_label": {"uk": "Кому (ім'я отримувача):", "ru": "Кому (имя получателя):", "en": "To (recipient name):"},
        "recipient_placeholder": {"uk": "Ім'я отримувача", "ru": "Имя получателя", "en": "Recipient name"},
        "sender_label": {"uk": "Від кого:", "ru": "От кого:", "en": "From:"},
        "sender_placeholder": {"uk": "Ваше ім'я", "ru": "Ваше имя", "en": "Your name"},
        "message_label": {"uk": "Побажання (опціонально):", "ru": "Пожелания (опционально):", "en": "Message (optional):"},
        "message_placeholder": {"uk": "Напишіть побажання...", "ru": "Напишите пожелания...", "en": "Write your message..."},
        "email_label": {"uk": "Email для доставки сертифікату:", "ru": "Email для доставки сертификата:", "en": "Email for certificate delivery:"},
        "email_placeholder": {"uk": "email@example.com", "ru": "email@example.com", "en": "email@example.com"},
        "preview_label": {"uk": "Попередній перегляд", "ru": "Предварительный просмотр", "en": "Preview"},
        "preview_title": {"uk": "Подарунковий сертифікат", "ru": "Подарочный сертификат", "en": "Gift Certificate"},
        "uah": {"uk": "гривень", "ru": "гривен", "en": "UAH"},
        "to_label": {"uk": "Кому:", "ru": "Кому:", "en": "To:"},
        "from_label": {"uk": "Від:", "ru": "От:", "en": "From:"},
        "code_label": {"uk": "Код сертифікату", "ru": "Код сертификата", "en": "Certificate Code"},
        "buy_btn": {"uk": "Придбати сертифікат", "ru": "Купить сертификат", "en": "Buy Certificate"},
        "why_ideal_title": {"uk": "Чому це ідеальний подарунок?", "ru": "Почему это идеальный подарок?", "en": "Why is this the perfect gift?"},
        "ideal_lovers_title": {"uk": "Для кавоманів", "ru": "Для кофеманов", "en": "For Coffee Lovers"},
        "ideal_lovers_text": {"uk": "Specialty кава 85+ SCA балів", "ru": "Specialty кофе 85+ SCA баллов", "en": "Specialty coffee 85+ SCA points"},
        "ideal_instant_title": {"uk": "Миттєво", "ru": "Мгновенно", "en": "Instant"},
        "ideal_instant_text": {"uk": "PDF сертифікат на email за хвилину", "ru": "PDF сертификат на email за минуту", "en": "PDF certificate to email in a minute"},
        "ideal_flexible_title": {"uk": "Гнучкість", "ru": "Гибкость", "en": "Flexibility"},
        "ideal_flexible_text": {"uk": "Дійсний рік, можна використати частинами", "ru": "Действителен год, можно использовать частями", "en": "Valid for a year, can be used in parts"},
        "ideal_design_title": {"uk": "Краса дизайну", "ru": "Красота дизайна", "en": "Beautiful Design"},
        "ideal_design_text": {"uk": "Стильний PDF, який приємно дарувати", "ru": "Стильный PDF, который приятно дарить", "en": "Stylish PDF that's a pleasure to give"},
        "questions_title": {"uk": "Залишились питання?", "ru": "Остались вопросы?", "en": "Have Questions?"},
        "questions_text": {"uk": "Напишіть нам — допоможемо обрати ідеальний подарунок!", "ru": "Напишите нам — поможем выбрать идеальный подарок!", "en": "Contact us — we'll help you choose the perfect gift!"},
        "contact_btn": {"uk": "Зв'язатися з нами", "ru": "Связаться с нами", "en": "Contact Us"}
    },
    
    # ABOUT PAGE
    "about_page": {
        "hero_badge": {"uk": "НАША ІСТОРІЯ", "ru": "НАША ИСТОРИЯ", "en": "OUR STORY"},
        "hero_title": {"uk": "Від ефіопських гір до вашої чашки", "ru": "От эфиопских гор до вашей чашки", "en": "From Ethiopian Mountains to Your Cup"},
        "hero_text": {"uk": "Ми — команда кавоманів, які побудували прямий ланцюг поставок з Ефіопії", "ru": "Мы — команда кофеманов, которые построили прямую цепь поставок из Эфиопии", "en": "We are a team of coffee lovers who built a direct supply chain from Ethiopia"},
        "feature_direct": {"uk": "Прямі закупки", "ru": "Прямые закупки", "en": "Direct Purchasing"},
        "feature_fresh": {"uk": "Свіжа обсмажка", "ru": "Свежая обжарка", "en": "Fresh Roasting"},
        "feature_sca": {"uk": "85+ балів SCA", "ru": "85+ баллов SCA", "en": "85+ SCA Points"},
        "stat_clients": {"uk": "Задоволених клієнтів", "ru": "Довольных клиентов", "en": "Happy Customers"},
        "stat_sca": {"uk": "Балів SCA Specialty", "ru": "Баллов SCA Specialty", "en": "SCA Specialty Points"},
        "stat_delivery": {"uk": "Від замовлення до доставки", "ru": "От заказа до доставки", "en": "From Order to Delivery"},
        "stat_direct": {"uk": "Пряме походження", "ru": "Прямое происхождение", "en": "Direct Origin"},
        "values_title": {"uk": "Наші цінності", "ru": "Наши ценности", "en": "Our Values"},
        "value_quality": {"uk": "Якість", "ru": "Качество", "en": "Quality"},
        "value_quality_text": {"uk": "Тільки specialty кава 85+ балів", "ru": "Только specialty кофе 85+ баллов", "en": "Only specialty coffee 85+ points"},
        "value_honesty": {"uk": "Чесність", "ru": "Честность", "en": "Honesty"},
        "value_honesty_text": {"uk": "Прозорі ціни, чесна інформація", "ru": "Прозрачные цены, честная информация", "en": "Transparent prices, honest information"},
        "value_sustainability": {"uk": "Сталий розвиток", "ru": "Устойчивое развитие", "en": "Sustainability"},
        "value_sustainability_text": {"uk": "Справедлива оплата фермерам", "ru": "Справедливая оплата фермерам", "en": "Fair payment to farmers"},
        "why_ethiopia_title": {"uk": "Чому Ефіопія?", "ru": "Почему Эфиопия?", "en": "Why Ethiopia?"},
        "why_ethiopia_text": {"uk": "Батьківщина кави з унікальним терруаром", "ru": "Родина кофе с уникальным терруаром", "en": "Birthplace of coffee with unique terroir"},
        "path_title": {"uk": "Наш шлях", "ru": "Наш путь", "en": "Our Journey"},
        "process_title": {"uk": "Наш процес", "ru": "Наш процесс", "en": "Our Process"},
        "team_title": {"uk": "Наша команда", "ru": "Наша команда", "en": "Our Team"},
        "try_title": {"uk": "Готові спробувати?", "ru": "Готовы попробовать?", "en": "Ready to Try?"},
        "try_text": {"uk": "Замовте свою першу пачку вже сьогодні", "ru": "Закажите свою первую пачку уже сегодня", "en": "Order your first pack today"},
        "try_btn": {"uk": "Обрати каву", "ru": "Выбрать кофе", "en": "Choose Coffee"}
    },
    
    # QUIZ PAGE - FULL
    "quiz_page": {
        "title": {"uk": "Тест: Яка кава вам підходить?", "ru": "Тест: Какой кофе вам подходит?", "en": "Quiz: Which Coffee Suits You?"},
        "subtitle": {"uk": "Відповідайте на 5 простих питань і ми підберемо ідеальну каву для вас", "ru": "Ответьте на 5 простых вопросов и мы подберем идеальный кофе для вас", "en": "Answer 5 simple questions and we'll find the perfect coffee for you"},
        "start_btn": {"uk": "Почати тест", "ru": "Начать тест", "en": "Start Quiz"},
        "next_btn": {"uk": "Далі", "ru": "Далее", "en": "Next"},
        "prev_btn": {"uk": "Назад", "ru": "Назад", "en": "Back"},
        "q1": {"uk": "Як ви готуєте каву?", "ru": "Как вы готовите кофе?", "en": "How do you brew coffee?"},
        "q1_a1": {"uk": "Еспресо-машина", "ru": "Эспрессо-машина", "en": "Espresso Machine"},
        "q1_a2": {"uk": "Фільтр / Воронка", "ru": "Фильтр / Воронка", "en": "Filter / Pour Over"},
        "q1_a3": {"uk": "Турка", "ru": "Турка", "en": "Turkish Pot"},
        "q1_a4": {"uk": "Френч-прес", "ru": "Френч-пресс", "en": "French Press"},
        "q2": {"uk": "Який смак вам ближче?", "ru": "Какой вкус вам ближе?", "en": "What flavor do you prefer?"},
        "q2_a1": {"uk": "Шоколад і горіхи", "ru": "Шоколад и орехи", "en": "Chocolate and Nuts"},
        "q2_a2": {"uk": "Ягоди і фрукти", "ru": "Ягоды и фрукты", "en": "Berries and Fruits"},
        "q2_a3": {"uk": "Квіткові ноти", "ru": "Цветочные ноты", "en": "Floral Notes"},
        "q2_a4": {"uk": "Пряний, насичений", "ru": "Пряный, насыщенный", "en": "Spicy, Rich"},
        "q3": {"uk": "Яку міцність обираєте?", "ru": "Какую крепость выбираете?", "en": "What strength do you prefer?"},
        "q3_a1": {"uk": "Легка (чайна)", "ru": "Легкая (чайная)", "en": "Light (tea-like)"},
        "q3_a2": {"uk": "Середня (баланс)", "ru": "Средняя (баланс)", "en": "Medium (balanced)"},
        "q3_a3": {"uk": "Міцна (насичена)", "ru": "Крепкая (насыщенная)", "en": "Strong (bold)"},
        "q4": {"uk": "Як часто п'єте каву?", "ru": "Как часто пьете кофе?", "en": "How often do you drink coffee?"},
        "q4_a1": {"uk": "Рідко (1-2 рази/тиждень)", "ru": "Редко (1-2 раза/неделю)", "en": "Rarely (1-2 times/week)"},
        "q4_a2": {"uk": "Іноді (3-4 рази/тиждень)", "ru": "Иногда (3-4 раза/неделю)", "en": "Sometimes (3-4 times/week)"},
        "q4_a3": {"uk": "Часто (щодня)", "ru": "Часто (каждый день)", "en": "Often (daily)"},
        "q4_a4": {"uk": "Кавоман (2+ чашки/день)", "ru": "Кофеман (2+ чашки/день)", "en": "Coffee Lover (2+ cups/day)"},
        "q5": {"uk": "Що для вас найважливіше?", "ru": "Что для вас самое важное?", "en": "What's most important to you?"},
        "q5_a1": {"uk": "Смак і аромат", "ru": "Вкус и аромат", "en": "Taste and Aroma"},
        "q5_a2": {"uk": "Енергія і бадьорість", "ru": "Энергия и бодрость", "en": "Energy and Alertness"},
        "q5_a3": {"uk": "Ритуал приготування", "ru": "Ритуал приготовления", "en": "Brewing Ritual"},
        "q5_a4": {"uk": "Користь для здоров'я", "ru": "Польза для здоровья", "en": "Health Benefits"},
        "result_title": {"uk": "Ваша ідеальна кава:", "ru": "Ваш идеальный кофе:", "en": "Your Perfect Coffee:"},
        "try_btn": {"uk": "Спробувати", "ru": "Попробовать", "en": "Try It"},
        "restart_btn": {"uk": "Пройти тест знову", "ru": "Пройти тест снова", "en": "Take Quiz Again"}
    },
    
    # B2B PAGE - FULL
    "b2b_page": {
        "title": {"uk": "B2B рішення", "ru": "B2B решения", "en": "B2B Solutions"},
        "subtitle": {"uk": "Specialty кава для вашого бізнесу", "ru": "Specialty кофе для вашего бизнеса", "en": "Specialty Coffee for Your Business"},
        "intro": {"uk": "Ми працюємо з кав'ярнями, ресторанами, готелями та офісами по всій Україні", "ru": "Мы работаем с кофейнями, ресторанами, отелями и офисами по всей Украине", "en": "We work with cafes, restaurants, hotels and offices across Ukraine"},
        "cafes_title": {"uk": "Для кав'ярень", "ru": "Для кофеен", "en": "For Cafes"},
        "cafes_text": {"uk": "Преміум зерно для вашого меню", "ru": "Премиум зерно для вашего меню", "en": "Premium beans for your menu"},
        "restaurants_title": {"uk": "Для ресторанів", "ru": "Для ресторанов", "en": "For Restaurants"},
        "restaurants_text": {"uk": "Ексклюзивні бленди під ваш бренд", "ru": "Эксклюзивные бленды под ваш бренд", "en": "Exclusive blends for your brand"},
        "offices_title": {"uk": "Для офісів", "ru": "Для офисов", "en": "For Offices"},
        "offices_text": {"uk": "Регулярні поставки для команди", "ru": "Регулярные поставки для команды", "en": "Regular supply for your team"},
        "hotels_title": {"uk": "Для готелів", "ru": "Для отелей", "en": "For Hotels"},
        "hotels_text": {"uk": "Преміум кава для гостей", "ru": "Премиум кофе для гостей", "en": "Premium coffee for guests"},
        "benefits_title": {"uk": "Чому обирають нас?", "ru": "Почему выбирают нас?", "en": "Why Choose Us?"},
        "benefit_quality": {"uk": "Specialty якість 85+ SCA", "ru": "Specialty качество 85+ SCA", "en": "Specialty quality 85+ SCA"},
        "benefit_price": {"uk": "Гуртові ціни", "ru": "Оптовые цены", "en": "Wholesale prices"},
        "benefit_delivery": {"uk": "Безкоштовна доставка", "ru": "Бесплатная доставка", "en": "Free delivery"},
        "benefit_support": {"uk": "Персональний менеджер", "ru": "Персональный менеджер", "en": "Personal manager"},
        "form_title": {"uk": "Залишити заявку", "ru": "Оставить заявку", "en": "Submit Request"},
        "form_name": {"uk": "Ваше ім'я", "ru": "Ваше имя", "en": "Your Name"},
        "form_company": {"uk": "Компанія", "ru": "Компания", "en": "Company"},
        "form_phone": {"uk": "Телефон", "ru": "Телефон", "en": "Phone"},
        "form_email": {"uk": "Email", "ru": "Email", "en": "Email"},
        "form_message": {"uk": "Повідомлення", "ru": "Сообщение", "en": "Message"},
        "form_submit": {"uk": "Надіслати заявку", "ru": "Отправить заявку", "en": "Submit Request"}
    },
    
    # ACCOUNT PAGE - FULL
    "account_page": {
        "title": {"uk": "Особистий кабінет", "ru": "Личный кабинет", "en": "My Account"},
        "login_title": {"uk": "Вхід", "ru": "Вход", "en": "Sign In"},
        "register_title": {"uk": "Реєстрація", "ru": "Регистрация", "en": "Sign Up"},
        "email_label": {"uk": "Email", "ru": "Email", "en": "Email"},
        "email_placeholder": {"uk": "Введіть email", "ru": "Введите email", "en": "Enter email"},
        "password_label": {"uk": "Пароль", "ru": "Пароль", "en": "Password"},
        "password_placeholder": {"uk": "Введіть пароль", "ru": "Введите пароль", "en": "Enter password"},
        "name_label": {"uk": "Ім'я", "ru": "Имя", "en": "Name"},
        "name_placeholder": {"uk": "Введіть ім'я", "ru": "Введите имя", "en": "Enter name"},
        "login_btn": {"uk": "Увійти", "ru": "Войти", "en": "Sign In"},
        "register_btn": {"uk": "Зареєструватися", "ru": "Зарегистрироваться", "en": "Sign Up"},
        "forgot_password": {"uk": "Забули пароль?", "ru": "Забыли пароль?", "en": "Forgot Password?"},
        "or": {"uk": "або", "ru": "или", "en": "or"},
        "google_login": {"uk": "Увійти через Google", "ru": "Войти через Google", "en": "Sign in with Google"},
        "no_account": {"uk": "Немає акаунту?", "ru": "Нет аккаунта?", "en": "Don't have an account?"},
        "have_account": {"uk": "Вже є акаунт?", "ru": "Уже есть аккаунт?", "en": "Already have an account?"},
        "my_orders": {"uk": "Мої замовлення", "ru": "Мои заказы", "en": "My Orders"},
        "my_subscription": {"uk": "Моя підписка", "ru": "Моя подписка", "en": "My Subscription"},
        "settings": {"uk": "Налаштування", "ru": "Настройки", "en": "Settings"},
        "logout": {"uk": "Вийти", "ru": "Выйти", "en": "Log Out"}
    },
    
    # DELIVERY PAGE - FULL
    "delivery_page": {
        "title": {"uk": "Доставка та оплата", "ru": "Доставка и оплата", "en": "Delivery & Payment"},
        "subtitle": {"uk": "Швидко, надійно, зручно", "ru": "Быстро, надежно, удобно", "en": "Fast, Reliable, Convenient"},
        "delivery_title": {"uk": "Способи доставки", "ru": "Способы доставки", "en": "Delivery Methods"},
        "nova_poshta": {"uk": "Нова Пошта", "ru": "Новая Почта", "en": "Nova Poshta"},
        "nova_poshta_text": {"uk": "1-2 дні по Україні", "ru": "1-2 дня по Украине", "en": "1-2 days across Ukraine"},
        "nova_poshta_price": {"uk": "від 50₴ або безкоштовно від 500₴", "ru": "от 50₴ или бесплатно от 500₴", "en": "from 50₴ or free from 500₴"},
        "ukrposhta": {"uk": "Укрпошта", "ru": "Укрпочта", "en": "Ukrposhta"},
        "ukrposhta_text": {"uk": "3-5 днів по Україні", "ru": "3-5 дней по Украине", "en": "3-5 days across Ukraine"},
        "ukrposhta_price": {"uk": "від 30₴", "ru": "от 30₴", "en": "from 30₴"},
        "courier": {"uk": "Кур'єр по Одесі", "ru": "Курьер по Одессе", "en": "Courier in Odessa"},
        "courier_text": {"uk": "В день замовлення", "ru": "В день заказа", "en": "Same day"},
        "courier_price": {"uk": "70₴ або безкоштовно від 500₴", "ru": "70₴ или бесплатно от 500₴", "en": "70₴ or free from 500₴"},
        "payment_title": {"uk": "Способи оплати", "ru": "Способы оплаты", "en": "Payment Methods"},
        "card": {"uk": "Оплата карткою", "ru": "Оплата картой", "en": "Card Payment"},
        "card_text": {"uk": "Visa, Mastercard, Apple Pay, Google Pay", "ru": "Visa, Mastercard, Apple Pay, Google Pay", "en": "Visa, Mastercard, Apple Pay, Google Pay"},
        "cod": {"uk": "Накладений платіж", "ru": "Наложенный платеж", "en": "Cash on Delivery"},
        "cod_text": {"uk": "Оплата при отриманні в Новій Пошті", "ru": "Оплата при получении в Новой Почте", "en": "Pay upon receipt at Nova Poshta"},
        "liqpay": {"uk": "LiqPay", "ru": "LiqPay", "en": "LiqPay"},
        "liqpay_text": {"uk": "Миттєва оплата онлайн", "ru": "Мгновенная оплата онлайн", "en": "Instant online payment"},
        "free_shipping_title": {"uk": "Безкоштовна доставка", "ru": "Бесплатная доставка", "en": "Free Shipping"},
        "free_shipping_text": {"uk": "При замовленні від 500₴ доставка Новою Поштою безкоштовна!", "ru": "При заказе от 500₴ доставка Новой Почтой бесплатна!", "en": "Free Nova Poshta delivery for orders over 500₴!"}
    },
    
    # FAQ PAGE - FULL
    "faq_page": {
        "title": {"uk": "Часті питання", "ru": "Частые вопросы", "en": "FAQ"},
        "subtitle": {"uk": "Відповіді на популярні питання", "ru": "Ответы на популярные вопросы", "en": "Answers to Common Questions"},
        "cat_delivery": {"uk": "Доставка", "ru": "Доставка", "en": "Delivery"},
        "cat_payment": {"uk": "Оплата", "ru": "Оплата", "en": "Payment"},
        "cat_product": {"uk": "Продукт", "ru": "Продукт", "en": "Product"},
        "cat_subscription": {"uk": "Підписка", "ru": "Подписка", "en": "Subscription"},
        "q1": {"uk": "Скільки коштує доставка?", "ru": "Сколько стоит доставка?", "en": "How much is delivery?"},
        "a1": {"uk": "Доставка Новою Поштою від 50₴. При замовленні від 500₴ — безкоштовно.", "ru": "Доставка Новой Почтой от 50₴. При заказе от 500₴ — бесплатно.", "en": "Nova Poshta delivery from 50₴. Free for orders over 500₴."},
        "q2": {"uk": "Як швидко доставляєте?", "ru": "Как быстро доставляете?", "en": "How fast do you deliver?"},
        "a2": {"uk": "Відправляємо протягом 24 годин. Доставка 1-2 дні по Україні.", "ru": "Отправляем в течение 24 часов. Доставка 1-2 дня по Украине.", "en": "We ship within 24 hours. Delivery 1-2 days across Ukraine."},
        "q3": {"uk": "Яка свіжість кави?", "ru": "Какая свежесть кофе?", "en": "How fresh is the coffee?"},
        "a3": {"uk": "Обсмажуємо під замовлення. Максимум 3 дні від обсмажки до відправки.", "ru": "Обжариваем под заказ. Максимум 3 дня от обжарки до отправки.", "en": "Roasted to order. Maximum 3 days from roast to shipment."},
        "q4": {"uk": "Чи можна повернути каву?", "ru": "Можно ли вернуть кофе?", "en": "Can I return the coffee?"},
        "a4": {"uk": "Так, протягом 14 днів. Детальніше на сторінці повернень.", "ru": "Да, в течение 14 дней. Подробнее на странице возвратов.", "en": "Yes, within 14 days. See our returns page for details."},
        "more_questions": {"uk": "Залишились питання?", "ru": "Остались вопросы?", "en": "Still have questions?"},
        "contact_us": {"uk": "Зв'яжіться з нами", "ru": "Свяжитесь с нами", "en": "Contact Us"}
    },
    
    # CONTACTS PAGE - FULL
    "contacts_page": {
        "title": {"uk": "Контакти", "ru": "Контакты", "en": "Contact Us"},
        "subtitle": {"uk": "Ми завжди раді вам допомогти", "ru": "Мы всегда рады вам помочь", "en": "We're Always Happy to Help"},
        "phone_title": {"uk": "Телефон", "ru": "Телефон", "en": "Phone"},
        "email_title": {"uk": "Email", "ru": "Email", "en": "Email"},
        "address_title": {"uk": "Адреса", "ru": "Адрес", "en": "Address"},
        "address_value": {"uk": "Одеса, Україна", "ru": "Одесса, Украина", "en": "Odessa, Ukraine"},
        "hours_title": {"uk": "Графік роботи", "ru": "График работы", "en": "Working Hours"},
        "hours_value": {"uk": "Пн-Пт: 9:00-18:00", "ru": "Пн-Пт: 9:00-18:00", "en": "Mon-Fri: 9:00-18:00"},
        "form_title": {"uk": "Напишіть нам", "ru": "Напишите нам", "en": "Write to Us"},
        "form_name": {"uk": "Ваше ім'я", "ru": "Ваше имя", "en": "Your Name"},
        "form_name_placeholder": {"uk": "Введіть ім'я", "ru": "Введите имя", "en": "Enter your name"},
        "form_email": {"uk": "Email", "ru": "Email", "en": "Email"},
        "form_email_placeholder": {"uk": "Введіть email", "ru": "Введите email", "en": "Enter email"},
        "form_subject": {"uk": "Тема", "ru": "Тема", "en": "Subject"},
        "form_subject_placeholder": {"uk": "Тема повідомлення", "ru": "Тема сообщения", "en": "Message subject"},
        "form_message": {"uk": "Повідомлення", "ru": "Сообщение", "en": "Message"},
        "form_message_placeholder": {"uk": "Ваше повідомлення...", "ru": "Ваше сообщение...", "en": "Your message..."},
        "form_submit": {"uk": "Надіслати", "ru": "Отправить", "en": "Send"},
        "social_title": {"uk": "Соціальні мережі", "ru": "Социальные сети", "en": "Social Media"},
        "messengers_title": {"uk": "Месенджери", "ru": "Мессенджеры", "en": "Messengers"}
    },
    
    # CART/DRAWER
    "cart": {
        "title": {"uk": "Ваш кошик", "ru": "Ваша корзина", "en": "Your Cart"},
        "your_cart": {"uk": "Ваш кошик", "ru": "Ваша корзина", "en": "Your Cart"},
        "empty": {"uk": "Кошик порожній", "ru": "Корзина пуста", "en": "Your cart is empty"},
        "to_catalog": {"uk": "Перейти до каталогу →", "ru": "Перейти в каталог →", "en": "Go to Catalog →"},
        "subtotal": {"uk": "Разом:", "ru": "Итого:", "en": "Subtotal:"},
        "checkout": {"uk": "Оформити замовлення", "ru": "Оформить заказ", "en": "Checkout"},
        "items": {"uk": "товарів", "ru": "товаров", "en": "items"},
        "free_shipping_progress": {"uk": "До безкоштовної доставки:", "ru": "До бесплатной доставки:", "en": "Until free shipping:"},
        "free_shipping_done": {"uk": "Безкоштовна доставка!", "ru": "Бесплатная доставка!", "en": "Free shipping!"},
        "remove": {"uk": "Видалити", "ru": "Удалить", "en": "Remove"},
        "safe_payment": {"uk": "Безпечна оплата", "ru": "Безопасная оплата", "en": "Secure Payment"},
        "return_days": {"uk": "14 днів на повернення", "ru": "14 дней на возврат", "en": "14 days return"}
    }
}

def update_jsons():
    for lang in ["uk", "ru", "en"]:
        path = BASE_DIR / "locales" / f"{lang}.json"
        with open(path, 'r', encoding='utf-8') as f:
            data = json.load(f)
        
        for section, keys in FULL_TRANSLATIONS.items():
            if section not in data:
                data[section] = {}
            for key, trans in keys.items():
                data[section][key] = trans[lang]
        
        with open(path, 'w', encoding='utf-8') as f:
            json.dump(data, f, ensure_ascii=False, indent=4)
        print(f"Updated {lang}.json with {sum(len(v) for v in FULL_TRANSLATIONS.values())} translations")

if __name__ == "__main__":
    print("Adding COMPLETE translations for all pages...")
    update_jsons()
    print("Done! Now need to add data-i18n attributes to HTML files.")
